Scenario: Получить список участников встречи по холдингу
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingListEmployees" распарсена и готова для подстановки ответа
    And мой запрос "список участников" содержит параметр "holding" и значение "1C-WN215CD"
    When я выполняю запрос сервиса "список участников"
    Then я бы ожидал получить "4" строки участников
    And я бы ожидал отсутствия дубликатов в полученном ответе

Scenario: Получить список участников встречи по субхолдингу
    Given авторизирован с ролью "ГКМ"
    And xml с именем "SubHoldingListEmployees" распарсена и готова для подстановки ответа
    And мой запрос "список участников" содержит параметр "holding" и значение "1C-JK771JK"
    When я выполняю запрос сервиса "список участников"
    Then я бы ожидал получить "2" строки участников
    And я бы ожидал отсутствия дубликатов в полученном ответе

Scenario: Получить список участников встречи не своего холдинга
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingListEmployees" распарсена и готова для подстановки ответа
    And мой запрос "список участников" содержит параметр "holding" и значение "2D-VN351CP"
    When я выполняю запрос сервиса "список участников"
    Then я бы ожидал получить ошибку "отсутствие доступа к холдингу"

Scenario: Получить список участников встречи несуществующего холдинга
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingListEmployees" распарсена и готова для подстановки ответа
    And мой запрос "список участников" содержит параметр "holding" и значение "2D-111111"
    When я выполняю запрос сервиса "список участников"
    Then я бы ожидал получить ошибку "холдинг не существует"
