Scenario: Получить структуру холдинга
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingStructure" распарсена и готова для подстановки ответа
    And мой запрос "структура холдинга" содержит параметр "holding" и значение "1C-WN215CD"
    When я выполняю запрос сервиса "структура холдинга"
    Then я бы ожидал получить "4" строки организаций

Scenario: Получить структуру холдинга не своего холдинга
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingStructure" распарсена и готова для подстановки ответа
    And мой запрос "структура холдинга" содержит параметр "holding" и значение "2D-VN351CP"
    When я выполняю запрос сервиса "структура холдинга"
    Then я бы ожидал получить ошибку "отсутствие доступа к холдингу"

Scenario: Получить структуру холдинга несуществующего холдинга
    Given авторизирован с ролью "ГКМ"
    And xml с именем "HoldingStructure" распарсена и готова для подстановки ответа
    And мой запрос "структура холдинга" содержит параметр "holding" и значение "2D-111111"
    When я выполняю запрос сервиса "структура холдинга"
    Then я бы ожидал получить ошибку "холдинг не существует"
